<?php

return [
    //about
    'title' => "สวัสดีครับ ผม พงศ์ภูมิ แก้วสูงเนิน",
    'sub_title' => "Full-Stack Laravel Developer",
    'paragraph_1' => "ในฐานะ Full-Stack Developer ผมให้ความสำคัญกับการ 'ออกแบบวิธีการแก้ปัญหา' มากกว่าแค่การเขียนโปรแกรม ผมเชื่อว่าหัวใจสำคัญของซอฟต์แวร์ที่มีคุณภาพคือการเลือกใช้เทคโนโลยีที่ตรงกับโจทย์จริงของธุรกิจ ดังนั้นผมจึงเริ่มต้นทุกโปรเจคด้วยการวิเคราะห์ความต้องการอย่างลึกซึ้ง เพื่อตัดสินใจเลือกใช้ Tech Stack ที่มีประสิทธิภาพสูงสุดสำหรับงานนั้นๆ ไม่ว่าจะเป็นความรวดเร็วในการส่งมอบงานผ่าน Livewire หรือการจัดการความซับซ้อนด้วย React/Vue เพื่อให้มั่นใจว่าเทคโนโลยีจะช่วยขับเคลื่อนธุรกิจได้อย่างมีประสิทธิภาพสูงสุด",
    'paragraph_2' => "ด้วยพื้นฐานที่แข็งแกร่งใน Laravel Ecosystem ผมมุ่งเน้นการสร้างระบบที่มีโครงสร้างชัดเจนและยั่งยืนผ่านสถาปัตยกรรมแบบ Action-DTO-Query ซึ่งช่วยจัดการลอจิกธุรกิจที่ซับซ้อนให้เป็นระเบียบและบำรุงรักษาง่าย มีประสบการณ์พัฒนาระบบระดับองค์กรและระบบ POS ตั้งแต่การออกแบบฐานข้อมูล (Oracle/MySQL) ไปจนถึงหน้าจอผู้ใช้งานที่ตอบสนองรวดเร็ว ปรัชญาการทำงานของผมคือการส่งมอบระบบที่เสถียร ยืดหยุ่น และพร้อมสเกลรองรับการเติบโตของธุรกิจในอนาคตได้อย่างไร้รอยต่อ",
    'skill_box_1' => "ออกแบบและพัฒนาระบบแบบ Full-Stack โดยวิเคราะห์และเลือกใช้เทคโนโลยีที่เหมาะสมและเกิดประสิทธิภาพสูงสุดต่อธุรกิจของคุณ",
    'skill_box_2' => "ออกแบบโครงสร้างโค้ดที่เป็นระเบียบ บำรุงรักษาง่าย และพร้อมสำหรับการสเกลด้วย",
    'skill_box_3' => "ออกแบบฐานข้อมูลและจัดการลอจิกธุรกิจที่ซับซ้อนให้ทำงานได้อย่างแม่นยำ",
    'about_localtion' => "สถานที่: นครราชสีมา, ประเทศไทย (ทำงานแบบ Remote 100%)",
    'about_status' => "สถานะ: พร้อมรับงานฟรีแลนซ์",
];
